[
    {
        "category": "Major",
        "id": 1,
        "project_name": "Sundown Studio Clone",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "I undertook the project to recreate the home page of the Sundown-Studio website as a means to enhance my front-end development skills. The focus was on accurately replicating the layout, design elements, and functionality of the original website's home page. This involved a comprehensive understanding and utilization of HTML, CSS, and JavaScript to achieve the desired visual and interactive effects.",
        "key_contributions": {
            "HTML": "I meticulously structured the HTML markup to mirror the layout of the original website, ensuring semantic correctness and accessibility.",
            "CSS": "Leveraging CSS, I styled the elements to match the visual aesthetics of the Sundown-Studio website, including fonts, colors, spacing, and responsive design for various screen sizes.",
            "JavaScript": "Implemented JavaScript functionalities to add interactivity and dynamic behavior to the home page, such as interactive sliders, navigation menus, and modal pop-ups."
        },
        "outcome": "Through this project, I honed my proficiency in front-end development technologies and gained valuable experience in replicating complex website layouts. This endeavor not only showcased my technical abilities but also demonstrated my attention to detail and commitment to delivering high-quality front-end solutions.",
        "image_data": "images/sundownStudio.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/SunDown-Studio-Clone",
        "view_site": true,
        "live_site": "https://k-e-akash.github.io/SunDown-Studio-Clone/"
    },
    {
        "category": "Major",
        "id": 2,
        "project_name": "OCHI Design Clone",
        "technologies_used": "React.js, Tailwind CSS",
        "description": "The OCHI Design Clone project aimed to replicate the design and functionality of the OCHI Design website using React.js and Tailwind CSS. By meticulously studying the original website's layout, design elements, and interactive features, I honed my front-end development skills while gaining practical experience in building responsive and visually appealing user interfaces.",
        "key_contributions": {
            "React.js": "Implemented various React components to recreate the structure and behavior of the OCHI Design website, ensuring modularity and reusability of code.",
            "Tailwind CSS": "Leveraged Tailwind CSS utility classes to style components and achieve pixel-perfect alignment and styling, closely resembling the original design."
        },
        "outcome": "Through this project, I deepened my understanding of React.js and Tailwind CSS, learning best practices for component-based UI development and responsive web design. The completed clone not only showcased my technical proficiency but also demonstrated my ability to accurately replicate complex website designs.",
        "image_data": "images/OchiDesign.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/OCHI-Design",
        "view_site": true,
        "live_site": "https://k-e-akash.github.io/OCHI-Design/"
    },
    {
        "category": "Major",
        "id": 3,
        "project_name": "FeastSwift",
        "technologies_used": "MongoDB, Express.js, React.js, Node.js, Tailwind CSS",
        "description": "FeastSwift is a food delivery application designed to streamline the process of ordering food online. It provides users with a convenient platform to explore the menu of a restaurant, place orders, and track delivery status in real-time. The application offers a seamless and intuitive user experience, combining robust backend services with a modern and responsive frontend interface.",
        "key_contributions": {
            "MongoDB": "Implemented MongoDB as the database solution to store restaurant details, menu items, user profiles, and order information, ensuring data integrity and scalability.",
            "Express.js": "Utilized Express.js to develop a RESTful API backend, defining routes for user authentication, restaurant management, order processing, and delivery tracking.",
            "React.js": "Developed dynamic and interactive user interfaces using React.js, creating components for restaurant listings, menu display, order checkout, and order tracking.",
            "Node.js": "Built a server-side application using Node.js to handle HTTP requests, manage user sessions, and orchestrate communication between the frontend and backend systems.",
            "Tailwind CSS": "Utilized Tailwind CSS utility classes to style components and layout elements, ensuring consistent and visually appealing designs across different screen sizes and devices."
        },
        "outcome": "The FeastSwift project provided valuable experience in full-stack web development, particularly in building robust and feature-rich applications using the MERN stack. By successfully implementing key functionalities such as user authentication, order management, and real-time tracking, the project demonstrated my ability to deliver scalable and user-friendly solutions in the rapidly evolving domain of online food delivery.",
        "image_data": "images/FeastSwift.webp",
        "view_code": false,
        "github": "None",
        "view_site": false,
        "live_site": "None"
    },
    {
        "category": "Major",
        "id": 4,
        "project_name": "Portfolio Website",
        "technologies_used": "React.js, Tailwind CSS",
        "description": "The Portfolio Website project is a personalized portfolio showcasing my skills, projects, and experiences. It serves as a platform to highlight my achievements and aspirations in the field of web development. In the future, there's a goal to expand this project into a MERN stack application, allowing users to create accounts, add their own data, and customize their portfolios according to their preferences.",
        "key_contributions": {
            "React.js": "Implemented React.js to build the frontend of the portfolio website, creating reusable components for layout, navigation, and content presentation.",
            "Tailwind CSS": "Utilized Tailwind CSS utility classes to style the components and achieve a modern, responsive design.",
            "Future Plans": "Planned the future expansion of the project into a MERN stack application, envisioning features such as user authentication, database management, and dynamic content rendering."
        },
        "outcome": "Through this project, I aim to establish a professional online presence and demonstrate my proficiency in web development technologies. The expansion into a MERN stack project will further enhance my skills in full-stack development, database management, and user authentication. By creating a customizable portfolio platform, I aspire to provide a valuable tool for showcasing individuals' talents and achievements in the digital realm.",
        "image_data": "images/MyPortfolio.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/OCHI-Design",
        "view_site": true,
        "live_site": "https://k-e-akash.github.io/OCHI-Design/"
    },
    {
        "category": "Minor",
        "id": 5,
        "project_name": "Docs App",
        "technologies_used": "React.js, Tailwind CSS, Framer Motion",
        "description": "The Docs App is a web application developed using React.js, Tailwind CSS, and Framer Motion. It serves as a comprehensive platform for creating and managing various types of documents, including notes and todo lists. With a sleek and intuitive user interface, users can seamlessly create, organize, and edit their notes and tasks.",
        "key_contributions": {
            "Developed the User Interface for Creating Notes and Todo Lists": "Designed and implemented the user interface components for creating and editing notes and todo lists. Ensured a user-friendly experience by focusing on intuitive layout and responsive design principles",
            "Integrated Animations Using Framer Motion": "Leveraged Framer Motion to introduce fluid animations throughout the application. Implemented smooth transitions and interactive elements to enhance the overall user experience and make interactions more engaging."
        },
        "outcome": "With its sleek design and efficient performance, the Docs App aims to empower users to boost productivity and effectively manage their documents in a digital environment.",
        "image_data": "images/DocsApp.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/React-DocsApp",
        "view_site": true,
        "live_site": "https://k-e-akash.github.io/React-DocsApp/"
    },
    {
        "category": "Major",
        "id": 6,
        "project_name": "Zoro ESports",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "Zoro ESports is a comprehensive frontend website featuring essential pages for user authentication, such as login, signup, and registration forms. The platform serves as a hub for hosting Online game tournaments and championships, where users can register, participate, and compete for prizes. With a sleek and intuitive interface, users can navigate seamlessly through the website, explore game details, register for tournaments, and stay updated with the latest events and announcements.",
        "key_contributions": {
            "HTML, CSS, JavaScript": "Developed the frontend components and pages, including user authentication forms, game cards, and tournament registration forms. Ensured a cohesive and visually appealing design while maintaining responsiveness and cross-browser compatibility."
        },
        "outcome": "The completion of Zoro ESports marks the establishment of a robust platform for hosting game tournaments and championships. With user-friendly navigation and seamless registration processes, the website aims to attract gaming enthusiasts and foster a thriving community of players. Future enhancements may include backend integration for tournament management, user profiles, and real-time game updates.",
        "image_data": "images/ZoroESports.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/Zoro-ESports",
        "view_site": true,
        "live_site": "https://zoro-esports.netlify.app/"
    },
    {
        "category": "Minor",
        "id": 7,
        "project_name": "Calculator",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "The Calculator project is a standard calculator application built entirely using HTML, CSS, and JavaScript. It provides basic arithmetic functionality for addition, subtraction, multiplication, and division, along with support for decimal numbers. The user interface is designed to resemble a traditional calculator, featuring buttons for inputting numbers and performing operations.",
        "key_contributions": {
            "HTML, CSS, JavaScript": "Developed the frontend interface and functionality of the calculator application using HTML for structure, CSS for styling, and JavaScript for implementing the logic behind arithmetic operations and user interactions."
        },
        "outcome": "The completion of the Calculator project offers users a simple yet functional tool for performing basic arithmetic calculations. With its intuitive user interface and responsive design, the calculator provides a seamless user experience across various devices and screen sizes. Future iterations of the project may include additional features such as memory functions, scientific notation support, and improved user customization options.",
        "image_data": "images/Calculator.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/Calculator",
        "view_site": true,
        "live_site": "https://k-e-akash.github.io/Calculator/"
    },
    {
        "category": "Minor",
        "id": 8,
        "project_name": "OWNit",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "OWNit is an elegant shopping site catering to luxury brands, offering a curated selection of high-end products. Beyond its sophisticated design and seamless user experience, OWNit holds a hidden surprise, adding an element of intrigue and excitement for users to discover.",
        "key_contributions": {
            "HTML, CSS, JavaScript": "Implemented frontend development tasks, including designing the user interface, styling the website, and adding interactive features using JavaScript."
        },
        "outcome": "The completion of OWNit represents the creation of a visually stunning and user-friendly shopping platform for luxury brands. With its captivating design and hidden surprise, the website aims to engage users and leave a memorable impression. Future enhancements may include expanding the product catalog, optimizing performance, and implementing additional features to elevate the shopping experience.",
        "image_data": "images/OwnIt.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/OWNit",
        "view_site": true,
        "live_site": "https://own-it.netlify.app/"
    },
    {
        "category": "Minor",
        "id": 9,
        "project_name": "Portfolio",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "The Portfolio project is a simple yet elegant webpage designed to showcase personal information, skills, projects, and experiences. Serving as a digital resume, it provides visitors with a comprehensive overview of the creator's background and capabilities in web development.",
        "key_contributions": {
            "HTML, CSS, JavaScript": "Executed frontend development tasks, encompassing the creation of the user interface, styling the webpage, and incorporating interactive elements using JavaScript."
        },
        "outcome": "The completion of the Portfolio project establishes a polished and professional online presence, enabling the creator to showcase their expertise and accomplishments to potential employers, clients, and collaborators. With its clean design and seamless navigation, the webpage serves as a valuable tool for networking and career advancement.",
        "image_data": "images/Portfolio.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/Portfolio",
        "view_site": true,
        "live_site": "https://portfolio-keakash.netlify.app/"
    },
    {
        "category": "Minor",
        "id": 10,
        "project_name": "Nam OTT",
        "technologies_used": "HTML, CSS, JavaScript",
        "description": "Nam OTT is an over-the-top (OTT) platform dedicated exclusively to Kannada movies. It provides a comprehensive collection of Kannada films for viewers to stream and enjoy. With a user-friendly interface and seamless navigation, Nam OTT aims to promote Kannada cinema and cater to the preferences of Kannada movie enthusiasts.",
        "key_contributions": {
            "HTML, CSS, JavaScript": "Executed frontend development tasks, encompassing the creation of the user interface, styling the webpage, and incorporating interactive elements using JavaScript."
        },
        "outcome": "The completion of Nam OTT marks the establishment of a specialized streaming platform for Kannada movies, offering viewers a convenient and accessible way to discover and watch their favorite films. With its sleek design and intuitive features, Nam OTT strives to enhance the viewing experience for Kannada cinema enthusiasts.",
        "image_data": "images/MyOTT.webp",
        "view_code": true,
        "github": "https://github.com/K-E-Akash/NamOTT",
        "view_site": true,
        "live_site": "https://namott.netlify.app/"
    }, 
    {
        "category": "Minor",
        "id": 11,
        "project_name": "TODO App",
        "technologies_used": "Next.js, Tailwind CSS",
        "description": "The TODO App is a task management application built using Next.js and styled with Tailwind CSS. It allows users to add tasks to a list and delete them after completion. The app provides a simple yet effective way to organize tasks and stay productive.",
        "key_contributions": {
            "Next.js, Tailwind CSS": "Implemented the frontend development tasks, including setting up the Next.js framework, designing the user interface, and styling the application using Tailwind CSS."
        },
        "outcome": "The development of the TODO App served as an introduction to the Next.js framework, providing valuable experience in building client-side rendered React applications. It also showcased the integration of Tailwind CSS for rapid styling and customization. The app offers a basic yet functional task management solution, laying the groundwork for future projects and learning opportunities.",
        "image_data": "images/TodoApp.webp",
        "view_code": false,
        "github": "None",
        "view_site": false,
        "live_site": "None"
    },
    {
        "category": "Other",
        "id": 12,
        "project_name": "FWD Tadpole",
        "technologies_used": "SolidWorks",
        "description": "FWD Tadpole involves the design and development of a braking system for a front wheel drive tadpole type electric vehicle. The project focuses on creating an efficient braking mechanism to ensure safe operation of the vehicle.",
        "key_contributions": {
            "Design": "Played a major role in designing the braking system and its components using SolidWorks CAD software. Collaborated with the team to iterate on designs and ensure compatibility with the vehicle.",
            "Team play": "Engaged in a collaborative endeavor within a multidisciplinary team comprising four units, actively contributing to the comprehensive design and assembly phases of the vehicle. Fostered seamless coordination with fellow teams to synchronize the design workflow and ensure the harmonious integration of various components. Furthermore, played a pivotal role in the fabrication process, meticulously constructing the vehicle from inception to fruition, culminating in the successful realization of a functional tadpole model."
        },
        "outcome": "The successful completion of the FWD Tadpole project resulted in the development of a fully functional tadpole vehicle equipped with an effective braking system. The vehicle demonstrates the team's ability to design and implement complex mechanical systems, highlighting their skills in CAD design, engineering, and project management.",
        "image_data": "images/Tadpole.webp",
        "view_code": false,
        "github": "None",
        "view_site": false,
        "live_site": "None"
    },
    {
        "category": "Other",
        "id": 13,
        "project_name": "Chopper style E-Cycle",
        "technologies_used": "Catia",
        "description": "The Chopper style E-Cycle project aimed at developing a convertible cycle with two distinct configurations: a chopper-style outdoor variant and an indoor-style compact version. The primary objective is to create an electric cycle that is easily dismantlable and portable, catering to users, diverse transportation needs.",
        "key_contributions": {
            "Design": "Engaged in extensive design research and prototyping phases to iterate on various concepts and refine the final design of the convertible cycle.",
            "Team play": "Demonstrated leadership skills within the team by overseeing material procurement, actively contributing to design discussions, and coordinating the fabrication process. Played a pivotal role in ensuring effective collaboration among team members to achieve project milestones and objectives."
        },
        "outcome": "The Chopper style E-Cycle project has been successfully completed. It has delivered a versatile and innovative electric cycle solution that seamlessly transitions between chopper and indoor styles. The outcome showcases the team's dedication to design excellence, functionality, and user convenience.",
        "image_data": "images/Chopper cycle.webp",
        "view_code": false,
        "github": "None",
        "view_site": false,
        "live_site": "None"
    },
    {
        "category": "DesignWork",
        "id": 14,
        "project_name": "FWD Tadpole",
        "image_data": "images/Tadpole CAD.webp"
    },
    {
        "category": "DesignWork",
        "id": 15,
        "project_name": "Tadpole Brake System",
        "image_data": "images/Brake system.webp"
    },
    {
        "category": "DesignWork",
        "id": 16,
        "project_name": "Master cylinder",
        "image_data": "images/Master cylinder.webp"
    },
    {
        "category": "DesignWork",
        "id": 17,
        "project_name": "Rear Axle",
        "image_data": "images/Rear axle.webp"
    },
    {
        "category": "DesignWork",
        "id": 18,
        "project_name": "Rear wheel",
        "image_data": "images/Rear wheel.webp"
    }
]